In [1]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
d = [4,8,15,16,23,42]
sr = pd.Series(d)

In [4]:
sr

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(sr)

pandas.core.series.Series

In [6]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
l = ['Don','Boss','Legend','Bhau','Bai','Systemmm','Carli','Boto','Dada','Heronin']
sl = pd.Series(l)

In [7]:
sl

0         Don
1        Boss
2      Legend
3        Bhau
4         Bai
5    Systemmm
6       Carli
7        Boto
8        Dada
9     Heronin
dtype: object

In [8]:
#Q3. Create a Pandas DataFrame that contains the following data:
d1 = {"Name":["Alice","Bob","Claire"],
     "Age":[25,30,27],
     "Gender":["Female","Male","female"]}
df1 = pd.DataFrame(d1)

In [9]:
print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  female

In [10]:
#Q4.What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with example

#Solution
"""
In Pandas, a `DataFrame` is a two-dimensional tabular data structure, similar to a spreadsheet or a SQL table. It consists of
rows and columns, where each column can contain different data types. It is one of the most commonly used data structures in
Pandas and provides powerful methods for data manipulation, analysis, and cleaning.

On the other hand, a `Series` is a one-dimensional labeled array in Pandas, similar to a Python list but with additional functionalities
and built-in labeling. It represents a single column of data with an associated index.

"""

'\nIn Pandas, a `DataFrame` is a two-dimensional tabular data structure, similar to a spreadsheet or a SQL table. It consists of\nrows and columns, where each column can contain different data types. It is one of the most commonly used data structures in\nPandas and provides powerful methods for data manipulation, analysis, and cleaning.\n\nOn the other hand, a `Series` is a one-dimensional labeled array in Pandas, similar to a Python list but with additional functionalities\nand built-in labeling. It represents a single column of data with an associated index.\n\n'

In [11]:
"""
DataFrame Example
"""
d2 = {"Name":["Don","Boss","Bhau"],
     "Age":[25,30,27],
     "City":["Bombay","NYC","Kanpur"]}
df2 = pd.DataFrame(d2)

In [12]:
df2

   Name  Age    City
0   Don   25  Bombay
1  Boss   30     NYC
2  Bhau   27  Kanpur

In [13]:
type(df2)

pandas.core.frame.DataFrame

In [14]:
"""
Series Example
"""
l2 = ['Don','Boss','Legend','Bhau','Bai','Systemmm','Carli','Boto','Dada','Heronin']
sl2 = pd.Series(l2)

In [15]:
sl2

0         Don
1        Boss
2      Legend
3        Bhau
4         Bai
5    Systemmm
6       Carli
7        Boto
8        Dada
9     Heronin
dtype: object

In [16]:
type(sl2)

pandas.core.series.Series

In [17]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of
# when you might use one of these functions?

#Solution
#let's take a dataframe df2

#add Coloum in df2
df2['Girlfriend'] = [8,5,9]
df2['Wealth in 100M'] = [2,3,1]

#Assign Index
index = [101,102,103]
df2.index = index

#add row
d3 = {'Name':['Boto','dada','Charlie'],
     'Age':[26,52,21],
     'Girlfriend':[6,17,1],
     'Wealth in 100M':[3,10,8],
     'City':['Delhi','Bangolore','Pune']}
df3 = pd.concat([df2,pd.DataFrame(d3)],ignore_index = True)

In [18]:
df3

      Name  Age       City  Girlfriend  Wealth in 100M
0      Don   25     Bombay           8               2
1     Boss   30        NYC           5               3
2     Bhau   27     Kanpur           9               1
3     Boto   26      Delhi           6               3
4     dada   52  Bangolore          17              10
5  Charlie   21       Pune           1               8

In [19]:
#describe in pandes
df3.describe()

             Age  Girlfriend  Wealth in 100M
count   6.000000    6.000000        6.000000
mean   30.166667    7.666667        4.500000
std    11.089034    5.354126        3.619392
min    21.000000    1.000000        1.000000
25%    25.250000    5.250000        2.250000
50%    26.500000    7.000000        3.000000
75%    29.250000    8.750000        6.750000
max    52.000000   17.000000       10.000000

In [20]:
#head in pandas
df3.head()

   Name  Age       City  Girlfriend  Wealth in 100M
0   Don   25     Bombay           8               2
1  Boss   30        NYC           5               3
2  Bhau   27     Kanpur           9               1
3  Boto   26      Delhi           6               3
4  dada   52  Bangolore          17              10

In [21]:
#tail in pandas
df3.tail()

      Name  Age       City  Girlfriend  Wealth in 100M
1     Boss   30        NYC           5               3
2     Bhau   27     Kanpur           9               1
3     Boto   26      Delhi           6               3
4     dada   52  Bangolore          17              10
5  Charlie   21       Pune           1               8

In [ ]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
#Solution
"""
In Pandas, both Series and DataFrame are mutable data structures, meaning you can modify their values, add or remove
elements, and change their content after they are created. On the other hand, the Panel data structure has been deprecated
since Pandas version 0.25.0 and is no longer considered part of the recommended API.
"""

In [23]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

#Solution
names = pd.Series(['Don','Boss','Legend','Bhau','Bai','Systemmm','Carli','Boto','Dada','Heronin'])
ages = pd.Series([25,30,22,27,23,45,23,59,32,35])
cities = pd.Series(['New York','San Francisco','Bombay','Chicago','Delhi','Los Angeles','Kanpur','Pune','Praygraj','London'])

df4 = pd.DataFrame({'Names':names,
                  'Age':ages,
                  'City':cities})

In [24]:
df4

      Names  Age           City
0       Don   25       New York
1      Boss   30  San Francisco
2    Legend   22         Bombay
3      Bhau   27        Chicago
4       Bai   23          Delhi
5  Systemmm   45    Los Angeles
6     Carli   23         Kanpur
7      Boto   59           Pune
8      Dada   32       Praygraj
9   Heronin   35         London